In [105]:
import pandas as pd
import numpy as np
import scipy.stats as stats

In [106]:
data=pd.read_csv(r"C:/Users/rakes/OneDrive\Desktop/FAC Algorisk Insights/all_stocks_5yr.csv")
df=pd.DataFrame(data)
df

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]

In [107]:
df1=df.head(1259)
df1

            date   open   high    low  close    volume Name
0     2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1     2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2     2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3     2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4     2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...          ...    ...    ...    ...    ...       ...  ...
1254  2018-02-01  54.00  54.64  53.59  53.88   3623078  AAL
1255  2018-02-02  53.49  53.99  52.03  52.10   5109361  AAL
1256  2018-02-05  51.99  52.39  49.75  49.76   6878284  AAL
1257  2018-02-06  49.32  51.50  48.79  51.18   6782480  AAL
1258  2018-02-07  50.91  51.98  50.89  51.40   4845831  AAL

[1259 rows x 7 columns]

In [108]:
df2=df.head(1259*2)
for i in range(0,1259):
    df2=df2.drop(i)
df2

            date      open      high       low     close     volume  Name
1259  2013-02-08   67.7142   68.4014   66.8928   67.8542  158168416  AAPL
1260  2013-02-11   68.0714   69.2771   67.6071   68.5614  129029425  AAPL
1261  2013-02-12   68.5014   68.9114   66.8205   66.8428  151829363  AAPL
1262  2013-02-13   66.7442   67.6628   66.1742   66.7156  118721995  AAPL
1263  2013-02-14   66.3599   67.3771   66.2885   66.6556   88809154  AAPL
...          ...       ...       ...       ...       ...        ...   ...
2513  2018-02-01  167.1650  168.6200  166.7600  167.7800   47230787  AAPL
2514  2018-02-02  166.0000  166.8000  160.1000  160.5000   86593825  AAPL
2515  2018-02-05  159.1000  163.8800  156.0000  156.4900   72738522  AAPL
2516  2018-02-06  154.8300  163.7200  154.0000  163.0300   68243838  AAPL
2517  2018-02-07  163.0850  163.4000  159.0685  159.5400   51608580  AAPL

[1259 rows x 7 columns]

Taking Portfolio to be having only two Stocks AAL and AAPL and assuming weights to be 50% and 50%

In [109]:
df3 = pd.DataFrame()
df3["returns"] = [0] * len(df1)  # Initialize df3 with the same number of rows as df1 and df2

for i in range(len(df1)):
    df1.at[i, "returns"] = (df1.at[i, "close"] - df1.at[i, "open"]) / df1.at[i, "open"] * 100
    df2.at[i+1259, "returns"] = (df2.at[i+1259, "close"] - df2.at[i+1259, "open"]) / df2.at[i+1259, "open"] * 100
    df3.at[i, "returns"] = (df1.at[i, "returns"] + df2.at[i+1259, "returns"]) / 2
df3["returns"].describe()

C:\Users\rakes\AppData\Local\Temp\ipykernel_16096\528274623.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.at[i, "returns"] = (df1.at[i, "close"] - df1.at[i, "open"]) / df1.at[i, "open"] * 100
C:\Users\rakes\AppData\Local\Temp\ipykernel_16096\528274623.py:7: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '-0.9583363523356966' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3.at[i, "returns"] = (df1.at[i, "returns"] + df2.at[i+1259, "returns"]) / 2

count    1259.000000
mean        0.022501
std         1.241541
min        -5.715619
25%        -0.665162
50%         0.061475
75%         0.828257
max         6.598055
Name: returns, dtype: float64

In [110]:
stats.jarque_bera(df3["returns"])

SignificanceResult(statistic=148.4916207655218, pvalue=5.694482286205306e-33)

Problem 2

In [111]:
arr=[]
for i in range(0,1259):
    arr.append(df3.at[i, "returns"])
arr.sort()
length=len(arr)
l1=1196 #95% of Total Array Length
l2=63
VaR=arr[l2]
sum=0
for i in range(0,l2):
    sum=sum+arr[i]
CoVaR=sum/l2

In [112]:
VaR

-1.9954793579005765

In [113]:
CoVaR

-2.8971021301546958

Problem 3

In [114]:
!pip install yfinance
import yfinance as yf
df1=pd.DataFrame(yf.download("^NSEI",start="2014-06-28",end="2024-06-29"))
df2=pd.DataFrame(yf.download("^NDX",start="2014-06-28",end="2024-06-29"))
import matplotlib.pyplot as plt

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

Requirement already satisfied: yfinance in c:\users\rakes\anaconda3\lib\site-packages (0.2.38)
Requirement already satisfied: pandas>=1.3.0 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (2.1.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (1.26.4)
Requirement already satisfied: requests>=2.31 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (2.31.0)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (4.9.3)
Requirement already satisfied: appdirs>=1.4.4 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (1.4.4)
Requirement already satisfied: pytz>=2022.5 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (2023.3.post1)
Requirement already satisfied: frozendict>=2.3.4 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (2.4.4)
Requirement already satisfied: peewee>=3.16.2 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (3.17.3)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (4.12.2)
Requirement already satisfied: html5lib>=1.1 in c:\users\rakes\anaconda3\lib\site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\rakes\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\users\rakes\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\users\rakes\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rakes\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\rakes\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\rakes\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\rakes\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\rakes\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.7)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\rakes\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2024.2.2)

In [115]:
df1["returns"]=(df1["Close"]-df1["Open"])/df1["Open"]*100
df2["returns"]=(df2["Close"]-df2["Open"])/df2["Open"]*100

In [116]:
corr_coefficient = df1["returns"].corr(df2["returns"])  
corr_coefficient

0.012117041881675245

Poor Positive Correlation between NASDAQ and NSE